In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('heights.csv')
df

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [3]:
Q1 = df.height.quantile(0.25)
Q1

5.3500000000000005

In [4]:
Q3 = df.height.quantile(0.75)
Q3

6.275

In [5]:
IQR= Q3 - Q1
IQR

0.9249999999999998

In [6]:
lower_limit = Q1 - 1.5*IQR
upper_limit = Q3 + 1.5*IQR

In [7]:
df[(df.height > upper_limit) | (df.height<lower_limit)]

     name  height
0   mohan     1.2
1   maria     2.3
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [8]:
df = df[(df.height < upper_limit) & (df.height>lower_limit)]

In [9]:
df

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1